package text

type Replies struct {
	Start                           string
	EnterKey                        string
	EnterKeySuccess                 string
	KeyAlreadyEntered               string
	EnterKeyWrong                   string
	IsNotValidURLError              string
	Downloading                     string
	SelectTheMode                   string
	EnableForwardingMode            string
	DisableForwardingMode           string
	YouHaveThisForwardChat          string
	UseItAgain                      string
	UsePrevForwardChat              string
	ChangePrevForwardChat           string
	ForwardMsgFromGroup             string
	UnableToFindTheGroup            string
	IMustBeAdminInTheGroup          string
	SuccessEnablingForwardMode      string
	ForwardingModeIsEnabled         string
	ForwardingModeIsDisabled        string
	ForwardingModeIsAlreadyEnabled  string
	ForwardingModeIsAlreadyDisabled string
	CannotChatYet                   string
	Says                            string
	Error                           string
}

func NewReplies() *Replies {
	return &Replies{
		"Привет! я мемасный бот 😎. Я умею скачивать видео из популярных соц сетей и отправлять тебе! Отправь мне ссылку, а я тебе видео!",
		"Введи секретный ключ:",
		"Супер! Теперь можешь пользоваться!",
		"Ты уже активировал секретный ключ",
		"Неверный ключ",
		"По такой ссылке не могу скачать(",
		"⏳",
		"Выберите режим:",
		"Включить режим пересылки",
		"Выключить режим пересылки",
		"Уже выбран чат для пересылки",
		"Использовать его снова?",
		"✅ Использовать предыдущий чат ",
		"🔁 Выбрать другой чат",
		"Перешли сообщение от группы(!), куда пересылать видосы:",
		"Не получилось определить групповой чат. Проверь что сообщение именно от группы",
		"Я должен быть администратором в этом чате, чтобы пересылать туда видео",
		"Режим пересылки включен! Видео будут отправляться в чатик ",
		"Пересылка включена ✅",
		"Пересылка выключена ❌",
		"Режим пересылки уже включен ✅, используй команду /change_mode",
		"Режим пересылки уже выключен ❌, используй команду /change_mode",
		"Я пока не умею общаться, но могу пересылать сообщения, если включишь режим через /change_mode",
		"говорит",
		"Произошла ошибка :(",
	}
}
