package text

type Reply struct {
	Start              string
	EnterKey           string
	EnterKeySuccess    string
	KeyAlreadyEntered  string
	EnterKeyWrong      string
	IsNotValidURLError string
	Error              string
}

func getReplies() *Reply {
	return &Reply{
		"Привет! я мемасный бот 😎. Я умею скачивать видео из популярных соц сетей и отправлять тебе! Отправь мне ссылку, а я тебе видео!",
		"Введи секретный ключ:",
		"Супер! Теперь можешь пользоваться!",
		"Ты уже активировал секретный ключ",
		"Неверный ключ",
		"По такой ссылке не могу скачать(",
		"Произошла ошибка :(",
	}
}

var Replies = getReplies()
